fdr/src/test/resources/requests/verifyPaymentNotice.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
<soapenv:Header/>
<soapenv:Body>
    <nod:verifyPaymentNoticeReq>
        <idPSP>{psp}</idPSP>
        <idBrokerPSP>{brokerPsp}</idBrokerPSP>
        <idChannel>{channel}</idChannel>
        <password>{channelPwd}</password>
        <qrCode>
            <fiscalCode>{pa}</fiscalCode>
            <noticeNumber>{noticeNumber}</noticeNumber>
        </qrCode>
    </nod:verifyPaymentNoticeReq>
</soapenv:Body>
</soapenv:Envelope>